In [108]:
#BUSN 5760 Assignment-1_Anjesh_Sahani
#Data Wrangling With Pandas
#Anjesh-Sahani
#ID= 4249264

#####################################################
#Importing the required package
import pandas as pd

In [109]:
#######################################################
#CSV dataset operations
#######################################################
#Q.1 
#Loading grades dataset from the local machine and storing in df1 dataframe
df1 = pd.read_csv("C:/Users/anjes/Desktop/Anjesh/HW-1/grades.csv")

#Just to check the data
#it has 104 rows and 4 columns
df1.shape

(104, 4)

In [110]:
#Q.2
#Just to verify that we got data, displaying first 10 row of data
df1.head(10)

#From head function's output, it is clear that there are 3 different column:- ID, Name, GPA, and Major of student.

   ID                 Name   GPA              Major
0  23            Rose Rios  3.97          Economics
1  55            Ian Brown  1.44  Political Science
2  54         Stanley Dean  3.75         Philosophy
3  19  Stephanie Henderson  1.86        Mathematics
4  81          Angela Mora  3.86            Physics
5  60          Mark Martin  1.47          Chemistry
6  47     Jennifer Perkins  2.88            English
7  11      William Stewart  1.27            Biology
8  34           Eric Moore  3.40            Spanish
9  70      Kenneth Rollins  2.37                Art

In [111]:
#Q.3
#Displaying last 10 rows of data
df1.tail(10)

#This function will display last 10 rows of data.

     ID                 Name   GPA        Major
94   20          Diane Brown  1.73  Mathematics
95   41     Brenda Valentine  3.10      Physics
96   86        Grace Hoffman  1.30    Chemistry
97   10          Joshua Ware  3.29      English
98   61  Ms. Samantha Steele  2.56      Spanish
99   22            Lisa Chen  1.45          Art
100  96         Jamie Knight  1.65     Business
101  95       Karen Williams  1.16     Business
102  80   Carrie Trujillo MD  1.44      Theatre
103  58         Renee Austin  2.60     Business

In [113]:
#Q.4
#Displaying basic summary statistics for the dataset
df1.describe()

#This function provide quick overview of numerical data.
#By using this function, we can have the 5 points summary information, 
#like mean, median, mode, max and standard deviation.
#Which is important to get the overview of data using single function.

#In this grades dataset the average gpa of student is 2.44, and the maximum is 3.97, we also have std deviation and 1st,2nd,3rd quartile value

               ID         GPA
count  104.000000  104.000000
mean    51.721154    2.447115
std     29.253979    0.827750
min      1.000000    1.030000
25%     26.750000    1.657500
50%     52.500000    2.465000
75%     77.250000    3.132500
max    100.000000    3.970000

In [114]:
#Q.5
#Check for duplicate rows and display them if they exist
df1.duplicated()

#duplicated() this function gives the information about which rows are duplicate, and that will denoted by boolean value True.
#There are 4 duplicate row in this dataset

0      False
1      False
2      False
3      False
4      False
       ...
99     False
100     True
101     True
102     True
103     True
Length: 104, dtype: bool

In [115]:
################
#OR ALTERNATIVE

df1.duplicated().sum()
#This function gives the total count of duplicate data
#There are 4 duplicate rows

4

In [117]:
#Q.6
#Drop any duplicate rows from the dataset.
df1.drop_duplicates(inplace = True)

#Inplace = True, This parameter is used to perform modifications on a DataFrame permanently
#drop_duplicates() this function will drop all the duplicate rows from the dataset.

In [118]:
#Just to verify that all the duplicate rows deleted or not
df1.shape

#There were 104 rows before deleting, but right now, ther are only 100 rows found. means 4 duplicate row deleted permanently.

(100, 4)

In [119]:
#Q.7
#Check rows with missing values and drop them if they exist
df1.isna().sum()

#There is no missing data in the dataset.

ID       0
Name     0
GPA      0
Major    0
dtype: int64

In [123]:
#Q.8
#Dropping missing value from the dataset
df1.dropna(inplace = True)
df1.isna().sum()

ID               0
Name             0
GPA              0
Major            0
Honor Student    0
dtype: int64

In [125]:
#Creating new column called Honor Student and assinging value "YES" if it's GPA is greater than 3.5 otherwise "NO"
# apply() function is used in this operation,
df1['Honor Student'] = df1['GPA'].apply(lambda GPA: 'Yes' if GPA > 3.5 else 'No')

#Display output
print(df1)

    ID                 Name   GPA              Major Honor Student
0   23            Rose Rios  3.97          Economics           Yes
1   55            Ian Brown  1.44  Political Science            No
2   54         Stanley Dean  3.75         Philosophy           Yes
3   19  Stephanie Henderson  1.86        Mathematics            No
4   81          Angela Mora  3.86            Physics           Yes
..  ..                  ...   ...                ...           ...
95  41     Brenda Valentine  3.10            Physics            No
96  86        Grace Hoffman  1.30          Chemistry            No
97  10          Joshua Ware  3.29            English            No
98  61  Ms. Samantha Steele  2.56            Spanish            No
99  22            Lisa Chen  1.45                Art            No

[100 rows x 5 columns]

In [127]:
####################################################################
#Excel dataset operation
#Loading excel dataset
####################################################################
#Q.1
#Loading Excel data
df2 = pd.read_excel("C:/Users/anjes/Desktop/Anjesh/HW-1/tuition.xlsx")

In [128]:
#Just by calling data frame name can also gives the information about first 5 and last 5 rows of data.
df2

     ID               Name State Resident  Tuition  Financial Aid
0    17    Alexandra Green            Yes  20000.0           5180
1    18    Alexandra Green             No  30000.0           7087
2    81        Angela Mora            Yes  20000.0          12031
3    57  Angela Oneill DDS            Yes  20000.0           7064
4     2   Anthony Martinez            Yes  20000.0           6479
..   ..                ...            ...      ...            ...
96   42       Summer Baker            Yes  20000.0          12094
97   43        Tamara Lowe            Yes  20000.0           5761
98   78   William Caldwell             No  30000.0          10663
99   11    William Stewart            Yes  20000.0           9349
100   4         Eric Ellis             No  30000.0          12978

[101 rows x 5 columns]

In [129]:
#Displaying the first 10 rows of data,
df2.head(10)

   ID                Name State Resident  Tuition  Financial Aid
0  17     Alexandra Green            Yes  20000.0           5180
1  18     Alexandra Green             No  30000.0           7087
2  81         Angela Mora            Yes  20000.0          12031
3  57   Angela Oneill DDS            Yes  20000.0           7064
4   2    Anthony Martinez            Yes  20000.0           6479
5   8        Barbara Tran            Yes  20000.0           9076
6  41    Brenda Valentine             No  30000.0           9915
7  40      Brittany Jones            Yes  20000.0          14916
8  80  Carrie Trujillo MD            Yes  20000.0           5444
9  45       Chase Sanders             No  30000.0           5594

In [130]:
#checking if there is any duplicate data
df2.duplicated().sum()

#There is 1 duplicate row found

1

In [131]:
#Droping duplicated rows from the dataset
df2.drop_duplicates(inplace = True)

In [132]:
#Just to verify
df2.shape
df2.duplicated().sum()

0

In [133]:
#Checking if there is any NA values in the dataset 
df2.isna().sum()

#From the output there is 4 rows that have missing value, 2 in State Resident, and 2 in Tuition

ID                0
Name              0
State Resident    2
Tuition           2
Financial Aid     0
dtype: int64

In [134]:
#Droping missing values from the df2 dataset
df2.dropna(inplace = True)

In [135]:
#Just to check if missing value removed or not
df2.shape
df2.isna().sum()

ID                0
Name              0
State Resident    0
Tuition           0
Financial Aid     0
dtype: int64

In [136]:
#Creating new column called cost, and adding the new value by subtraction financual aid from tuition
df2["Cost"] =df2["Tuition"]-df2["Financial Aid"]
print(df2)

#what happen is an additional column called Cost get created and result is stored in that column.

    ID                 Name State Resident  Tuition  Financial Aid     Cost
0   17      Alexandra Green            Yes  20000.0           5180  14820.0
1   18      Alexandra Green             No  30000.0           7087  22913.0
2   81          Angela Mora            Yes  20000.0          12031   7969.0
3   57    Angela Oneill DDS            Yes  20000.0           7064  12936.0
4    2     Anthony Martinez            Yes  20000.0           6479  13521.0
..  ..                  ...            ...      ...            ...      ...
95  90  Stephanie Stevenson            Yes  20000.0          13431   6569.0
96  42         Summer Baker            Yes  20000.0          12094   7906.0
97  43          Tamara Lowe            Yes  20000.0           5761  14239.0
98  78     William Caldwell             No  30000.0          10663  19337.0
99  11      William Stewart            Yes  20000.0           9349  10651.0

[98 rows x 6 columns]

In [137]:
#Merge the two dataframes into a new dataframe called “df3” using a full join(Outer Join) on the “ID” column
df3 = pd.merge(df1,df2, on="ID", how="outer")
print(df3)

    ID               Name_x   GPA              Major Honor Student  \
0   23            Rose Rios  3.97          Economics           Yes
1   55            Ian Brown  1.44  Political Science            No
2   54         Stanley Dean  3.75         Philosophy           Yes
3   19  Stephanie Henderson  1.86        Mathematics            No
4   81          Angela Mora  3.86            Physics           Yes
..  ..                  ...   ...                ...           ...
95  41     Brenda Valentine  3.10            Physics            No
96  86        Grace Hoffman  1.30          Chemistry            No
97  10          Joshua Ware  3.29            English            No
98  61  Ms. Samantha Steele  2.56            Spanish            No
99  22            Lisa Chen  1.45                Art            No

                 Name_y State Resident  Tuition  Financial Aid     Cost
0             Rose Rios            Yes  20000.0        11038.0   8962.0
1             Ian Brown            Yes  20000.0         6977.0  13023.0
2          Stanley Dean            Yes  20000.0        11481.0   8519.0
3                   NaN            NaN      NaN            NaN      NaN
4           Angela Mora            Yes  20000.0        12031.0   7969.0
..                  ...            ...      ...            ...      ...
95     Brenda Valentine             No  30000.0         9915.0  20085.0
96        Grace Hoffman             No  30000.0        12102.0  17898.0
97          Joshua Ware             No  30000.0        11174.0  18826.0
98  Ms. Samantha Steele             No  30000.0        13103.0  16897.0
99            Lisa Chen             No  30000.0         9901.0  20099.0

[100 rows x 10 columns]

In [138]:
# Check df3 for missing values and drop the rows if they exist
df3.isna().sum()

#10 Rows found that has missing

ID                0
Name_x            0
GPA               0
Major             0
Honor Student     0
Name_y            2
State Resident    2
Tuition           2
Financial Aid     2
Cost              2
dtype: int64

In [139]:
#Removing the mising data from dataset
df3.dropna(inplace = True)

In [141]:
#Checking if it is removed or not
df3.isna().sum()

#There is no missing value anymore in the dataset

ID                0
Name_x            0
GPA               0
Major             0
Honor Student     0
Name_y            0
State Resident    0
Tuition           0
Financial Aid     0
Cost              0
dtype: int64

In [142]:
#Group the students by major and display the mean GPA and mean cost by major

#Group the students by major and display the mean GPA by major
mean_gpa = df3.groupby("Major").GPA.mean()

#Display result
print(mean_gpa)

Major
Art                  2.760000
Biology              2.586667
Business             2.051667
Chemistry            2.652000
Economics            3.970000
English              2.658000
History              2.567273
Mathematics          1.640000
Philosophy           2.701667
Physics              2.345000
Political Science    1.440000
Spanish              2.258333
Theatre              2.322857
Name: GPA, dtype: float64

In [143]:
#Group the students by major and display the mean cost by major
mean_cost = df3.groupby("Major").Cost.mean()

#Display result
print(mean_cost)

Major
Art                  11472.125000
Biology              13674.111111
Business             12010.666667
Chemistry            13750.800000
Economics             8962.000000
English              12958.000000
History              11793.636364
Mathematics          14377.600000
Philosophy           13188.333333
Physics              13250.750000
Political Science    13023.000000
Spanish              10735.000000
Theatre              11180.714286
Name: Cost, dtype: float64

In [146]:
#Filter out everyone with a GPA below a 2.0
filter_result = df3[df3["GPA"]<2.0]
print(filter_result)

    ID              Name_x   GPA              Major Honor Student  \
1   55           Ian Brown  1.44  Political Science            No
5   60         Mark Martin  1.47          Chemistry            No
7   11     William Stewart  1.27            Biology            No
18  39      Patrick Thomas  1.98            History            No
19  89       Derrick Jones  1.38         Philosophy            No
20  73       Rebecca Kelly  1.60        Mathematics            No
21  12     Jonathon Thomas  1.39            Physics            No
29  96        Jamie Knight  1.65           Business            No
33  25         Mark Hester  1.85            Spanish            No
38   3       Shawn Gilbert  1.85           Business            No
42  74        Claudia Wall  1.25            Spanish            No
45  59     Christina Irwin  1.79         Philosophy            No
46   4          Eric Ellis  1.20        Mathematics            No
48  95      Karen Williams  1.16           Business            No
53  91        Donald Ayala  1.41                Art            No
55  21          Dana Hodge  1.52            History            No
56  87      Matthew Ortega  1.62            Theatre            No
59  93   Dr. Jonathan Cook  1.39            History            No
61  38          Eric Myers  1.39        Mathematics            No
62  26        Julie Stuart  1.03            Physics            No
64  49           Judy Hunt  1.51            English            No
69  80  Carrie Trujillo MD  1.44            Theatre            No
74  97        Linda Dalton  1.30            Spanish            No
82   8        Barbara Tran  1.84          Chemistry            No
85  44        Derek Knight  1.36            Spanish            No
86  29    Jonathan Coleman  1.66                Art            No
90  72         Joseph Beck  1.56            Spanish            No
94  20         Diane Brown  1.73        Mathematics            No
96  86       Grace Hoffman  1.30          Chemistry            No
99  22           Lisa Chen  1.45                Art            No

                Name_y State Resident  Tuition  Financial Aid     Cost
1            Ian Brown            Yes  20000.0         6977.0  13023.0
5          Mark Martin            Yes  20000.0        12477.0   7523.0
7      William Stewart            Yes  20000.0         9349.0  10651.0
18      Patrick Thomas            Yes  20000.0        12634.0   7366.0
19       Derrick Jones             No  30000.0        14396.0  15604.0
20       Rebecca Kelly             No  30000.0        14502.0  15498.0
21     Jonathon Thomas             No  30000.0        12411.0  17589.0
29        Jamie Knight             No  30000.0         9843.0  20157.0
33         Mark Hester            Yes  20000.0        12729.0   7271.0
38       Shawn Gilbert            Yes  20000.0        14750.0   5250.0
42        Claudia Wall            Yes  20000.0        12958.0   7042.0
45     Christina Irwin             No  30000.0        13709.0  16291.0
46          Eric Ellis             No  30000.0        12978.0  17022.0
48      Karen Williams             No  30000.0        13375.0  16625.0
53        Donald Ayala            Yes  20000.0         9745.0  10255.0
55          Dana Hodge            Yes  20000.0        14628.0   5372.0
56      Matthew Ortega            Yes  20000.0        11835.0   8165.0
59   Dr. Jonathan Cook            Yes  20000.0         8386.0  11614.0
61          Eric Myers            Yes  20000.0         7008.0  12992.0
62        Julie Stuart            Yes  20000.0        12640.0   7360.0
64           Judy Hunt            Yes  20000.0         9404.0  10596.0
69  Carrie Trujillo MD            Yes  20000.0         5444.0  14556.0
74        Linda Dalton            Yes  20000.0        11388.0   8612.0
82        Barbara Tran            Yes  20000.0         9076.0  10924.0
85        Derek Knight            Yes  20000.0         8172.0  11828.0
86    Jonathan Coleman            Yes  20000.0         9574.0  10426.0
90         Joseph Beck            Yes  20000.0        11743.0   8257.0
94         Diane Brown             No  30000.0        11660.0  18340.0
96       Grace Hoffman             No  30000.0        12102.0  17898.0
99           Lisa Chen             No  30000.0         9901.0  20099.0

In [147]:
# Sort by ID in descending order
sorted_result = df3.sort_values(by="ID", ascending=False) #False will give me descennding order of ID

#Printing result
print(sorted_result)

     ID                Name_x   GPA        Major Honor Student  \
80  100    Lawrence Rodriguez  2.66      Theatre            No
67   99  Mrs. Mary Sampson MD  3.43          Art            No
11   98        Donald Blevins  3.52      Theatre           Yes
74   97          Linda Dalton  1.30      Spanish            No
29   96          Jamie Knight  1.65     Business            No
..  ...                   ...   ...          ...           ...
63    5        Chelsea Flores  3.01    Chemistry            No
46    4            Eric Ellis  1.20  Mathematics            No
38    3         Shawn Gilbert  1.85     Business            No
77    2      Anthony Martinez  2.86      History            No
51    1          Nicole Allen  3.17      Biology            No

                  Name_y State Resident  Tuition  Financial Aid     Cost
80    Lawrence Rodriguez            Yes  20000.0        13674.0   6326.0
67  Mrs. Mary Sampson MD            Yes  20000.0         8653.0  11347.0
11        Donald Blevins            Yes  20000.0        12147.0   7853.0
74          Linda Dalton            Yes  20000.0        11388.0   8612.0
29          Jamie Knight             No  30000.0         9843.0  20157.0
..                   ...            ...      ...            ...      ...
63        Chelsea Flores            Yes  20000.0         9534.0  10466.0
46            Eric Ellis             No  30000.0        12978.0  17022.0
38         Shawn Gilbert            Yes  20000.0        14750.0   5250.0
77      Anthony Martinez            Yes  20000.0         6479.0  13521.0
51          Nicole Allen            Yes  20000.0         9677.0  10323.0

[98 rows x 10 columns]

In [148]:
# Export df3 as a CSV file 
df3.to_csv("df3_output.csv", index=False)

In [149]:
# Export df3 as an Excel file
df3.to_excel("df3_output.xlsx", index=False)